file = open('Equation1.txt') # Відкриваємо файл
    
expressions = file.readlines() # Читаєм все шо є

for expression in expressions: # Перебираємо всі вирази

    brackets = '' 
    for c in expression: # Проходимо вираз посимвольно - ()-5+4 -> "(" потім ")" потім "-" потім "5" потім "+" потім "4"
        if c in ('(', ')'): # Якшо знаходимо дужку
            brackets = brackets + c # Записуємо її у спец. змінну
            if c == ')': # Якшо це закриваюча дужка
                if len(brackets) >= 2: # То має мати 2 символа. Тобто відрита дужка і закрита це два знаки. Якшо у нас один символ це означає шо відкриваючої дужки не хватає і вираз у нас неправильний. Коли дужки 2 значить все норм і ми їх стираємо. В результаті виконання програми коли змінна brackets пуста то все з дужками окей. А якшо не пуста, то десь помилка і вираз хибний.
                    if brackets[-1] == ')' and brackets[-2] == '(':
                        brackets = brackets[:-2]
    if brackets:
        print('Тут хибно ', expression)
    else:
        print('Тут істинно', expression)
